<a href="https://colab.research.google.com/github/DanielMickB/pembelajaranmesin/blob/main/praktikum2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
path_="/content/drive/My Drive/Machine Learning/praktikum-02.csv"
dataset=pd.read_csv(path_)
dataset

In [7]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
plt.scatter(dataset["Mileage"], dataset["Sell Price ($)"])

In [11]:
x=dataset[["Mileage","Age (yrs)"]]
y=dataset["Sell Price ($)"]

In [20]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,random_state=10)

In [17]:
x_train

    Mileage  Age (yrs)
12    59000          5
14    82450          7
6     52000          5
17    69000          5
5     59000          5
4     46000          4
10    83000          7
18    87600          8
1     35000          3
13    58780          4
3     22500          2
0     69000          6
19    52000          5
2     57000          5
9     67000          6
16    28000          2